/*По желанию, т.к. такая особенность практически не используется) Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть выглядеть должно примерно так:
'for(...){здесь пусто }'
Помните, что в первом, втором и третьем раздела цикла можно не только писать условия, или увеличивать счетчик например на 1, допустимы любые выражения, например вызовы функций.*/
'use strict';
for (let count = 0; checkCount(count); count++) {
    
}

function checkCount(value) {
    if (value < 10) {
        console.log(value);
        return true;
    } else {
        return false;
    }
}